<!DOCTYPE html>
<html lang="es">
    <head>
            <meta charset="UTF-8">
            <meta name="viewport" content="width=device-width, initial-scale=1.0">
            <link rel="stylesheet" href="styles.css"/>
            <link rel="Shortcut Icon" href="../Imagenes/icono.png">
            <title>Caracteristicas CSS3</title>
    </head>
    <body>
        <nav class="menuCSS3">
            <ul>
                <li><a href="index.html">Inicio</a></li>
                <li><a href="#">HTML5</a>
                    <ul>
                        <li><a href="html5.html">Definici&oacute;n</a></li>
                        <li><a href="novedadeshtml5.html">Novedades</a></li>
                        <li><a href="etiquetashtml5.html">Etiquetas Nuevas</a></li>
                    </ul>
                </li>
                <li><a href="#">CSS3</a>
                    <ul>
                        <li><a href="css3.html">Definici&oacute;n</a></li>
                        <li><a href="caracteristicascss3.html">Caracter&iacute;sticas</a></li>
                        <li><a href="ventajasdesventajascss3.html">Ventajas y desventajas</a></li>
                    </ul>
                </li>
                <li><a href="#">JavaScript</a>
                    <ul>
                        <li><a href="javascript.html">Definici&oacute;n</a></li>
                    </ul>
                </li>
                <li><a href="#">Herramientas</a>
                    <ul>
                        <li><a href="developertool.html">Firefox Developer Tools</a></li>
                        <li><a href="DevTools.html">Chrome DevTools</a></li>
                    </ul>
                </li>
                <li><a href="Formulario.html">Contacto</a></li>
            </ul>
        </nav>
            <section>
                <h1>Caracteristicas de CSS3</h1>
                   <p>
                        <ol>
                            <li> Atributo gradiente de colores en borde con CSS y Firefox: Posibilidad de definir el un gradiente de color en el borde de los elementos con CSS, en un atributo no est&aacute;ndar de Firefox. </li>
                            <li>Bordes redondeados en CSS 3: Las caracter&iacute;sticas de CSS 3 incluyen bordes redondeados, a trav&eacute;s del atributo border-radius, que define la curvatura que debe tener el borde del elemento.</li>
                            <li>M&uacute;ltiples im&aacute;genes de fondo con CSS: C&oacute;mo conseguir que un elemento de la p&aacute;gina tenga varias im&aacute;genes de fondo a la vez, con CSS b&aacute;sico y con caracter&iacute;sticas de CSS 3. </li>
                            <li>Colores RGBA en CSS 3: Veremos qu&eacute; son los colores RGBA y su notaci&oacute;n, que se incluyen en la especificaci&oacute;n de Hojas de Estilo en Cascada CSS 3. </li>
                            <li>Word-wrap en CSS 3: Una propiedad de CSS 3 que sirve para romper las palabras que son demasiado largas y no caben enteras por la anchura de una caja. </li>
                            <li>Textos multi-columna con CSS 3: CSS 3 incorpora nuevos atributos para que el navegador se encargue de producir texto multicolumna, es decir, que maquete directamente el texto en varias columnas sin tener que hacer nosotros nada.</li>
                            <li>Bordes con im&aacute;genes en CSS 3: El atributo border-image y varios otros de CSS 3 har&aacute;n posible la utilizaci&oacute;n de im&aacute;genes como bordes de los elementos de la p&aacute;gina, sin c&oacute;digo HTML especial, simplemente con hojas de estilo. </li>
                            <li>Sombras en CSS 3 con box-shadow: Crear sombras en CSS3 con el atributo box-shadow. Por fin podremos aplicar sombras a los elementos de la p&aacute;gina, sin usar im&aacute;genes, Javascript ni nada extra, simplemente con un atributo de CSS 3.</li>
                            <li>Resplandor exterior con CSS3: Cómo realizar un elemento que tenga un resplandor exterior con CSS3 y la propiedad box-shadow.</li>
                            <li>Propiedad background-origin de CSS 3: La propiedad de CSS 3 background-origin permite decidir la posici&oacute;n de la im&aacute;gen de fondo con respecto al borde, padding o el contenido del elemento.</li>
                            <li> Atributos CSS3 overflow-x y overflow-y: Descripción de los atributos de CSS3 overflow-x y overflow-y, que sirven para definir c&oacute;mo renderizar un contenido cuando sobrepasa los l&iacute;mites de un contenedor en la horizontal o vertical. </li>
                            <li>Introducci&oacute;n a @font-face de CSS: Fuentes en CSS 3. Sint&aacute;xis y principales caracter&iacute;sticas de la regla CSS @font-face, que nos permite utilizar cualquier tipograf&iacute;a en una p&aacute;gina web.</li>
                            <li>Sombras en el texto con text-shadow de CSS: C&oacute;mo aplicar sombras y otros efectos en los textos con CSS y el atributo text-shadow. </li>
                        </ol>
                   </p>
            </section>
    </body>
</html>