<!DOCTYPE html>
<html lang="es">
    <head>
            <meta charset="UTF-8">
            <meta name="viewport" content="width=device-width, initial-scale=1.0">
            <link rel="stylesheet" href="styles.css"/>
            <title>Definicion HTML5</title>
    </head>
    <body>
            <nav class="menuCSS3">
                    <ul>
                        <li><a href="index.html">Inicio</a></li>
                        <li><a href="#">HTML5</a>
                            <ul>
                                <li><a href="htm5.html">Definicion</a></li>
                                <li><a href="#">Paco</a></li>
                                <li><a href="#">Ramón</a></li>
                                <li><a href="#">María</a></li>
                            </ul>
                        </li>
                        <li><a href="#">FAQ</a></li>
                        <li><a href="#">Contacto</a>
                            <ul>
                                <li><a href="#">Email</a></li>
                                <li><a href="#">Mapa</a></li>
                            </ul>
            
                        </li>
                    </ul>
                </nav>
            <h1>Definici&oacute;n</h1>
            <section>
                   <p>
                        El nombre hojas de estilo en cascada viene del ingl&eacute;s Cascading Style Sheets, del que toma sus siglas. CSS es un lenguaje usado para definir la presentaci&oacute;n de un documento estructurado escrito en HTML o XML (y por extensi&oacute;n en XHTML). El W3C(World Wide Web Consortium) es el encargado de formular la especificaci&oacute;n de las hojas de estilo que servir&aacute;n de est&aacute;ndar para los agentes de usuario o navegadores.<br/>
                        La idea que se encuentra detr&aacute;s del desarrollo de CSS es separar la estructura de un documento de su presentaci&oacute;n.<br/>
                        La información de estilo puede ser adjuntada como un documento separado o en el mismo documento HTML. En este &uacute;ltimo caso podr&iacute;an definirse estilos generales en la cabecera del documento o en cada etiqueta particular mediante el atributo "style".
                   </p>
            </section>
            <section>
                <p>
                    <h1>Para qu&eacute; sirve el CSS3</h1>
                    <p>
                        El CSS sirve para definir la est&eacute;tica de un sitio web en un documento externo y eso mismo permite que modificando ese documento (la hoja CSS) podamos cambiar la est&eacute;tica entera de un sitio web, el mismo sitio web puede variar totalmente de est&eacute;tica cambiando solo la CSS, sin tocar para nada los documentos HTML o jsp o asp que lo componen.<br/>
                        CSS es un lenguaje utilizado para dar est&eacute;tica a un documento HTML (colores, tama&ntilde;os de las fuentes, tama&ntilde;os de elemento, con css podemos establecer diferentes reglas que indicar&aacute;n como debe presentarse un documento. Podemos indicar propiedades como el color, el tama&ntilde;o de la letra, el tipo de letra, si es negrita, si es it&aacute;lica, tambi&eacute;n se puede dar forma a otras cosas que no sean letras, como colores de fondo de una p&aacute;gina, tama&ntilde;os de un elemento (por ejemplo el alto y el ancho de una tabla. 
                    </p>
                </p>
            </section>
    </body>
</html>