<!DOCTYPE html>
<html lang="es">
    <head>
            <meta charset="UTF-8">
            <meta name="viewport" content="width=device-width, initial-scale=1.0">
            <link rel="stylesheet" href="styles.css"/>
            <link rel="Shortcut Icon" href="../Imagenes/icono.png">
            <title>Definicion HTML5</title>
    </head>
    <body>
            <nav class="menuCSS3">
                    <ul>
                        <li><a href="index.html">Inicio</a></li>
                        <li><a href="#">HTML5</a>
                            <ul>
                                <li><a href="html5.html">Definici&oacute;n</a></li>
                                <li><a href="novedadeshtml5.html">Novedades</a></li>
                                <li><a href="etiquetashtml5.html">Etiquetas Nuevas</a></li>
                            </ul>
                        </li>
						<li><a href="#">CSS3</a>
							<ul>
                                <li><a href="css3.html">Definici&oacute;n</a></li>
                                <li><a href="caracteristicascss3.html">Caracter&iacute;sticas</a></li>
                                <li><a href="ventajasdesventajascss3.html">Ventajas y desventajas</a></li>
							</ul>
						</li>
                        <li><a href="#">JavaScript</a>
                            <ul>
                                <li><a href="javascript.html">Definici&oacute;n</a></li>
                            </ul>
                        </li>
                        <li><a href="#">Herramientas</a>
                            <ul>
                                <li><a href="developertool.html">Firefox Developer Tools</a></li>
                                <li><a href="DevTools.html">Chrome DevTools</a></li>
                            </ul>
                        </li>
                        <li><a href="Formulario.html">Contacto</a></li>
                    </ul>
                </nav>
            <h1>Definici&oacute;n</h1>
            <section>
                   <p>HTML5  es la &uacute;ltima versi&oacute;n de HTML. El t&eacute;rmino representa dos conceptos diferentes:
                       <ul>
                           <li>Se trata de una nueva versi&oacute;n de HTML, con nuevos elementos, atributos y comportamientos.</li>
                           <li>Contiene un conjunto m&aacute;s amplio de tecnolog&iacute;as que permite a los sitios Web y a las aplicaciones ser más diversas y de gran alcance. A este conjunto se le llama HTML5 y amigos, a menudo reducido a HTML5 .</li>
                       </ul>
                    </p>
                    <p>Diseñado para ser utilizable por todos los desarrolladores de Open Web, esta p&aacute;gina referencia numerosos recursos sobre las tecnolog&iacute;as de HTML5, clasificados en varios grupos seg&uacute;n su funci&oacute;n.
                        <ul>
                            <li>Sem&aacute;ntica: Permite describir con mayor precisi&oacute;n cu&aacute;l es su contenido.</li>
                            <li>Conectividad: Permite comunicarse con el servidor de formas nuevas e innovadoras.</li>
                            <li>Sin conexi&oacute;n y almacenamiento: Permite a las p&aacute;ginas web almacenar datos localmente en el lado del cliente y operar sin conexi&oacute;n de manera m&aacute;s eficiente.</li>
                            <li>Multimedia: Nos otorga un excelente soporte para utilizar contenido multimedia como lo son audio y video nativamente.</li>
                            <li>Gr&aacute;ficos y efectos 2D/3D: Proporciona una amplia gama de nuevas caracter&iacute;sticas que se ocupan de los gr&aacute;ficos en la web como lo son canvas 2D, WebGL, SVG, etc.</li>
                            <li>Rendimiento e Integraci&oacute;n: Proporciona una mayor optimizaci&oacute;n de la velocidad y un mejor uso del hardware.</li>
                            <li>Acceso al dispositivo: Proporciona APIs para el uso de varios componentes internos de entrada y salida de nuestro dispositivo.</li>
                            <li>CSS3: Nos ofrece una nueva gran variedad de opciones para hacer diseños m&aacute;s sofisticados.</li>
                        </ul>
                    </p>
                    <p>El desarrollo de este lenguaje de marcado es regulado por el Consorcio W3C.</p>
            </section>
            <section>
                <p>
                    Ejemplo de un archivo de HTML5
                </p>
            </section>
    </body>
</html>