<!DOCTYPE html>
<html lang="es">
    <head>
            <meta charset="UTF-8">
            <meta name="viewport" content="width=device-width, initial-scale=1.0">
            <title>Novedades HTML5</title>
    </head>
    <body>
            <h1>Novedades HTML5</h1>
            <article>
                <p>En t&eacute;rminos de Markup, el HTML5 introduce algunos elementos que hacen que se aggiorne a los tiempos que corren. As&iacute;, muchas de las novedades est&aacute;n relacionadas con la forma de construir websites que se tiene en la actualidad. Una de las m&aacute;s importantes novedades est&aacute; relacionada con la inserci&oacute;n de multimedia en los sitios web, que ahora contar&aacute;n con etiquetas HTML especiales para poder ser incluidos. Por otro lado, algunos aspectos de diseño también son incluidos en el lenguaje, as&iacute; como tambi&eacute;n algunos detalles de navegaci&oacute;n. Veremos todo esto en algunas líneas.</p>
            </article>
            <article>
                <p>Con el uso de HTML5, se puede reducir la dependencia de los plug-ins que tenemos que tener instalados para poder ver una determinada web. Caso emblemático, el de Adobe Flash, que se ve claramente perjudicado por la instauraci&oacute;n de este est&aacute;ndar. Por otro lado, fue un avance importante para dispositivos que de forma nativa no soportaban Flash, y que no soportaban tampoco plug-ins necesarios para hacerlo. Otro caso emblem&aacute;tico, el del iPhone. Pero adem&aacute;s, con HTML5 se ampl&iacute;a el horizonte del desarrollo de aplicaciones que pueden ser usadas en una multiplicidad de dispositivos.</p>
            </article>
            <article>
                <p>Gracias a HTML5, los usuarios pueden acceder a sitios web de manera offline, sin estar conectados a internet. Se suma tambi&eacute;n la funcionalidad de drag and drop, y la edici&oacute;n online de documentos ampliamente popularizada por Google Docs. La geolocalizaci&oacute;n es uno de sus puntos fuertes, pero por otro lado, las etiquetas diseñadas especialmente para el audio y el video ahorran la necesidad de tener que tener un plug-in de Flash y, al mismo tiempo, asestan un golpe mortal al producto de Adobe, que cada vez se est&aacute; usando menos. Sin embargo, es importante destacar que Flash sigue siendo utilizado y HTML5 todav&iacute;a no hizo el “salto grande”, aunque est&aacute; en camino.</p>
            </article>
    </body>
</html>